# Books

![png](Images/books_ERD_draft_hz.png)

## Imports

In [4]:
# Import Pandas
import pandas as pd

# PyMySQL
import pymysql
pymysql.install_as_MySQLdb()

# SQLAlchemy
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Quote Plus
from urllib.parse import quote_plus

## Load Data

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
# password = quote_plus("") 
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books)

Successfully connected to local MySQL.

## Create New Database

In [7]:
# Create new database if it does not already exist
if database_exists(connection) == False:
  create_database(connection)
  print('Database created')
else:
  print('The database already exists')

The database already exists

In [8]:
# Verify, again, database now exists
database_exists(connection)

True

## Create Tables from Imported .csv Files

In [12]:
# Read previously saved .csv files and save as a pd df
users = pd.read_csv('Data/users.csv')
print(users.head())

# Save df as a table in db
users.to_sql('users', engine, if_exists = 'replace')

# Verify table successfully added to db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

  Tables_in_books
0           users

In [13]:
# Read previously saved .csv files and save as a pd df
books = pd.read_csv('Data/books.csv')
print(books.head())

# Save df as a table in db
books.to_sql('books', engine, if_exists = 'replace')

# Verify table successfully added to db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

  Tables_in_books
0           books
1           users

In [14]:
# Read previously saved .csv files and save as a pd df
authors = pd.read_csv('Data/authors.csv')
print(authors.head())

# Save df as a table in db
authors.to_sql('authors', engine, if_exists = 'replace')

# Verify table successfully added to db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

  Tables_in_books
0         authors
1           books
2           users

In [15]:
# Read previously saved .csv files and save as a pd df
favorites = pd.read_csv('Data/favorites.csv')
print(favorites.head())

# Save df as a table in db
favorites.to_sql('favorites', engine, if_exists = 'replace')

# Verify table successfully added to db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

  Tables_in_books
0         authors
1           books
2       favorites
3           users

All four tables successfully added to database.

In [16]:
# Query: List all favorite book titles of John Doe
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"))
;"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

John Doe's favorite books!